s1/section-1.2.6-v2-testing-for-primality.org
* 1.2.6. Example: Testing for Primality (with exercises)

** Searching for Divisors - $O(\sqrt{n})$ version
One way to test if a positive integer $n$ is a prime is to walk through every integer $a$, $a \lt n$, and if some of such $a$ divides $n$, then $n$ is not prime.

Idea of the algorithm is to find a smallest divisor of a supposed prime number, and if it's the number itself, then it's prime.

Key observation here is that we only need to check such $a$ that $a \lt \sqrt{n}$, for if $a | n$, then also $\frac{n}{a} | n$, by checking one divisor we also check the other. As it's impossible to have both divisors $\gt \sqrt{n}$, then it'll suffice to check only first $\sqrt{n}$.

#+name: sequential-test
#+begin_src racket
  #lang sicp

  (define (square x) (* x x))

  (define (prime? n)
    (= (smallest-divisor n) n))

  (define (smallest-divisor n)
    (find-divisor n 2))

  (define (find-divisor n test-divisor)
    (cond ((> (square test-divisor) n) n)
	  ((divides? test-divisor n) test-divisor)
	  (else (find-divisor n (+ test-divisor 1)))))

  (define (divides? d n)
    (= (remainder n d) 0))

#+end_src

** The Fermat's Test - $O(\log{n})$ probabilistic version
The $O(\log{n})$ version is based on the Little Fermat's Theorem.

*The Little Fermat's Theorem*
#+begin_quote
Let $n$ and $a$ be positive integers with $a \lt n$. Then, if $n$ is prime, then $a^n \equiv a \pmod{n}$.
#+end_quote

By taking contrapositive, if $a^n \not\equiv a \pmod{n}$, then $n$ is not a prime. However, in general, $a^n \equiv a \pmod{n}$ does not imply that $n$ is a prime.

This gives the idea for a test for whether given $n$ is a prime: pick some random $a \lt n$, if $a^n \not\equiv a \pmod{n}$ then $n$ is not a prime, otherwise $n$ is /probably/ a prime. The more such $a$'s pass the test, the more likely $n$ is a prime.

This is called *the Fermat's test*.

To implement it, we need an efficient way to compute $a^n\mod{n}$. Property of congruence used for this is that if $a \equiv b \pmod{p}$ and $c \equiv d \pmod{p}$, then $a \cdot c \equiv b \cdot d \pmod{p}$. It is similar to fast exponentiation in approach, and has $O(\log{n})$ time complexity.

For individual test, random number picked should be between in the $[2, n-1]$ interval. The ~(random x)~ primitive returns non-negative integer less then ~x~. So ~(+ 1 (random (- n 1))~ will do the job.

#+name: fast-test
#+begin_src racket
  #lang sicp

  (define (expmod base exp m)
    (define (square x) (* x x))
    (cond ((= exp 0) 1)
	  ((even? exp)
	   (remainder (square (expmod base (/ exp 2) m))
		      m))
	  (else
	   (remainder (* base (expmod base (- exp 1) m))
		      m))))

  (define (fermat-test n)
    (define (try-it d)
      (= (expmod d n n) d))
    (try-it (+ 1 (random (- n 1)))))

  (define (fast-prime? n times)
    (cond ((= 0 times) #t)
	  ((fermat-test n) (fast-prime? n (dec times)))
	  (else #f)))


#+end_src

The main danger with the Fermat's test is that if it says $n$ is prime, it's /likely/ true (although, if it says $n$ is /not/ a prime, it's 100% true). There are numbers, called Carmichael numbers (e.g. 561) that fool the Fermat's test.

** Ex 1.21 - Try out the functions

#+begin_src racket :noweb yes :exports both :cache yes
  <<sequential-test>>

  (smallest-divisor 199)
  (smallest-divisor 1999)
  (smallest-divisor 19999)

  (prime? 199)
  (prime? 1999)
  (prime? 19999)
#+end_src

#+RESULTS[47b76b3c28653795f7763733167361ac5ea0cc01]:
: 199
: 1999
: 7
: #t
: #t
: #f

#+begin_src racket :noweb yes :exports both :cache yes
  <<fast-test>>

  (fast-prime? 199 5)
  (fast-prime? 1999 5)
  (fast-prime? 19999 5)
#+end_src

#+RESULTS[e38b5b27d7e88a8192f8857d5ad08e75cbfe0d94]:
: #t
: #t
: #f

