s1/section-1.2.6-v2-testing-for-primality.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-05-21 Sun 18:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="LMG" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga44ff39">1. 1.2.6. Example: Testing for Primality (with exercises)</a>
<ul>
<li><a href="#org922cddc">1.1. Searching for Divisors - \(O(\sqrt{n})\) version</a></li>
<li><a href="#orga157279">1.2. The Fermat's Test - \(O(\log{n})\) probabilistic version</a></li>
<li><a href="#org77f9eb8">1.3. Ex 1.21 - Try out the functions</a></li>
<li><a href="#orgeaa9bc2">1.4. Ex 1.22 - Timing the \(O(\sqrt{n})\) version</a></li>
<li><a href="#orgfff38ea">1.5. Ex 1.23 - Optimize the \(O(\sqrt{n})\) version</a></li>
<li><a href="#org5b462ef">1.6. Ex 1.24 - Timing the \(O(\log{n})\) version</a></li>
<li><a href="#org5837ee8">1.7. Ex 1.25 - Would naive expmod work?</a></li>
<li><a href="#org1f8de14">1.8. Ex 1.26 - Why "normal-order"-esque `square turns \(O(\log{n})\) into \(O(n)\)</a></li>
<li><a href="#orgc11382e">1.9. Ex 1.27 - Ensure Carmichael numbers fool the Fermat test</a></li>
<li><a href="#org3b52b9d">1.10. Ex 1.28 - Implement the Miller-Rabin test</a>
<ul>
<li><a href="#orgf4a2a66">1.10.1. Alternate form of the Fermat's Little Theorem:</a></li>
<li><a href="#orgd4e8623">1.10.2. Miller-Rabin test</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orga44ff39" class="outline-2">
<h2 id="orga44ff39"><span class="section-number-2">1.</span> 1.2.6. Example: Testing for Primality (with exercises)</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org922cddc" class="outline-3">
<h3 id="org922cddc"><span class="section-number-3">1.1.</span> Searching for Divisors - \(O(\sqrt{n})\) version</h3>
<div class="outline-text-3" id="text-1-1">
<p>
One way to test if a positive integer \(n\) is a prime is to walk through every integer \(a\), \(a \lt n\), and if some of such \(a\) divides \(n\), then \(n\) is not prime.
</p>

<p>
Idea of the algorithm is to find a smallest divisor of a supposed prime number, and if it's the number itself, then it's prime.
</p>

<p>
Key observation here is that we only need to check such \(a\) that \(a \lt \sqrt{n}\), for if \(a | n\), then also \(\frac{n}{a} | n\), by checking one divisor we also check the other. As it's impossible to have both divisors \(\gt \sqrt{n}\), then it'll suffice to check only first \(\sqrt{n}\).
</p>

<div class="org-src-container">
<pre class="src src-racket" id="orgb6b06e2">#lang sicp

(define (square x) (* x x))

(define (prime? n)
  (= (smallest-divisor n) n))

(define (smallest-divisor n)
  (find-divisor n 2))

(define (find-divisor n test-divisor)
  (cond ((&gt; (square test-divisor) n) n)
	((divides? test-divisor n) test-divisor)
	(else (find-divisor n (+ test-divisor 1)))))

(define (divides? d n)
  (= (remainder n d) 0))

</pre>
</div>
</div>
</div>

<div id="outline-container-orga157279" class="outline-3">
<h3 id="orga157279"><span class="section-number-3">1.2.</span> The Fermat's Test - \(O(\log{n})\) probabilistic version</h3>
<div class="outline-text-3" id="text-1-2">
<p>
The \(O(\log{n})\) version is based on the Little Fermat's Theorem.
</p>

<p>
<b>The Little Fermat's Theorem</b>
</p>
<blockquote>
<p>
Let \(n\) and \(a\) be positive integers with \(a \lt n\). Then, if \(n\) is prime, then \(a^n \equiv a \pmod{n}\).
</p>
</blockquote>

<p>
By taking contrapositive, if \(a^n \not\equiv a \pmod{n}\), then \(n\) is not a prime. However, in general, \(a^n \equiv a \pmod{n}\) does not imply that \(n\) is a prime.
</p>

<p>
This gives the idea for a test for whether given \(n\) is a prime: pick some random \(a \lt n\), if \(a^n \not\equiv a \pmod{n}\) then \(n\) is not a prime, otherwise \(n\) is <i>probably</i> a prime. The more such \(a\)'s pass the test, the more likely \(n\) is a prime.
</p>

<p>
This is called <b>the Fermat's test</b>.
</p>

<p>
To implement it, we need an efficient way to compute \(a^n\mod{n}\). Property of congruence used for this is that if \(a \equiv b \pmod{p}\) and \(c \equiv d \pmod{p}\), then \(a \cdot c \equiv b \cdot d \pmod{p}\). It is similar to fast exponentiation in approach, and has \(O(\log{n})\) time complexity.
</p>

<p>
For individual test, random number picked should be between in the \([2, n-1]\) interval. The <code>(random x)</code> primitive returns non-negative integer less then <code>x</code>. So <code>(+ 1 (random (- n 1))</code> will do the job.
</p>

<div class="org-src-container">
<pre class="src src-racket" id="org1796fe3">#lang sicp

(define (expmod base exp m)
  (define (square x) (* x x))
  (cond ((= exp 0) 1)
	((even? exp)
	 (remainder (square (expmod base (/ exp 2) m))
		    m))
	(else
	 (remainder (* base (expmod base (- exp 1) m))
		    m))))

(define (fermat-test n)
  (define (try-it d)
    (= (expmod d n n) d))
  (try-it (+ 1 (random (- n 1)))))

(define (fast-prime? n times)
  (cond ((= 0 times) #t)
	((fermat-test n) (fast-prime? n (dec times)))
	(else #f)))


</pre>
</div>

<p>
The main danger with the Fermat's test is that if it says \(n\) is prime, it's <i>likely</i> true (although, if it says \(n\) is <i>not</i> a prime, it's 100% true). There are numbers, called Carmichael numbers (e.g. 561) that fool the Fermat's test.
</p>
</div>
</div>

<div id="outline-container-org77f9eb8" class="outline-3">
<h3 id="org77f9eb8"><span class="section-number-3">1.3.</span> Ex 1.21 - Try out the functions</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">
<pre class="src src-racket">#lang sicp

(define (square x) (* x x))

(define (prime? n)
  (= (smallest-divisor n) n))

(define (smallest-divisor n)
  (find-divisor n 2))

(define (find-divisor n test-divisor)
  (cond ((&gt; (square test-divisor) n) n)
	((divides? test-divisor n) test-divisor)
	(else (find-divisor n (+ test-divisor 1)))))

(define (divides? d n)
  (= (remainder n d) 0))


(smallest-divisor 199)
(smallest-divisor 1999)
(smallest-divisor 19999)

(prime? 199)
(prime? 1999)
(prime? 19999)
</pre>
</div>

<pre class="example">
199
1999
7
#t
#t
#f
</pre>


<div class="org-src-container">
<pre class="src src-racket">#lang sicp

(define (expmod base exp m)
  (define (square x) (* x x))
  (cond ((= exp 0) 1)
	((even? exp)
	 (remainder (square (expmod base (/ exp 2) m))
		    m))
	(else
	 (remainder (* base (expmod base (- exp 1) m))
		    m))))

(define (fermat-test n)
  (define (try-it d)
    (= (expmod d n n) d))
  (try-it (+ 1 (random (- n 1)))))

(define (fast-prime? n times)
  (cond ((= 0 times) #t)
	((fermat-test n) (fast-prime? n (dec times)))
	(else #f)))



(fast-prime? 199 5)
(fast-prime? 1999 5)
(fast-prime? 19999 5)
</pre>
</div>

<pre class="example">
#t
#t
#f
</pre>
</div>
</div>
