s1/section-1.2.6-v2-testing-for-primality.org
** Ex 1.22 - Timing the $O(\sqrt{n})$ version

~(runtime)~ returns an integer that specifies the amount of time the system has been running.
This can be used to measure execution time.

#+begin_src racket :noweb yes
  <<sequential-test>>
  
  (define (timed-prime-test n)
    (define (time start-time)
      (prime? n)
      (- (runtime) start-time))
    (time (runtime)))

  (define (timed-prime-test-avg n times)
    (define (iter sum count)
      (if (= count 0)
	  sum
	  (iter (+ sum (timed-prime-test n))
		(dec count))))
    (/ (iter 0 times) (* 1.0 times)))

  (define (display-time-measurement n duration)
    (display "|")
    (display n)
    (display "|")
    (display duration)
    (display "|")
    (newline))

  (define (search-for-primes n limit)
    (cond ((= limit 0) (display ""))
	  ((prime? n)
	   (display-time-measurement n (timed-prime-test-avg n 1000))
	   (search-for-primes (+ n 1) (dec limit)))
	  (else
	   (search-for-primes (+ n 1) limit))))
  (search-for-primes 100000 3)
  (search-for-primes 1000000 3)
  (search-for-primes 10000000 3)
  (search-for-primes 100000000 3)
  (search-for-primes 1000000000 3)
  (search-for-primes 10000000000 3)
  (search-for-primes 100000000000 3)

#+end_src


#+NAME: times-sequential
|--------------+---------|
|       100003 |   0.933 |
|       100019 |   0.918 |
|       100043 |    0.91 |
|      1000003 |   2.767 |
|      1000033 |   2.795 |
|      1000037 |   2.768 |
|     10000019 |   8.637 |
|     10000079 |   8.615 |
|     10000103 |   8.608 |
|    100000007 |   27.17 |
|    100000037 |  27.139 |
|    100000039 |  27.309 |
|   1000000007 |   86.77 |
|   1000000009 |  86.236 |
|   1000000021 |   86.75 |
|  10000000019 | 279.596 |
|  10000000033 | 271.998 |
|  10000000061 | 272.127 |
| 100000000003 | 859.095 |
| 100000000019 | 862.939 |
| 100000000057 | 859.008 |
|--------------+---------|

#+begin_src racket :exports both :cache yes
  (sqrt 10)
  (/ 860.0 272.0)
  (/ 272.0 86.7)
  (/ 86.7 27.3)
  (/ 27.3 8.6)
  (/ 8.6 2.7)
#+end_src

#+RESULTS[c936d520f8857ae2792199407f4d396ed02d1a06]:
: 3.1622776601683795
: 3.161764705882353
: 3.1372549019607843
: 3.1758241758241756
: 3.174418604651163
: 3.1851851851851847

10-fold increase in input yields an execution time increase very close to $\sqrt{10}$, which is in line with the our expectations.


