s1/section-1.2.6-v2-testing-for-primality.org
** Ex 1.23 - Optimize the $O(\sqrt{n})$ version
#+begin_src racket
  #lang sicp

  (define (square x) (* x x))

  (define (prime? n)
    (= (smallest-divisor-opt-2 n) n))

  (define (smallest-divisor-orig n)
    (find-divisor-opt-1 n 2))

  (define (smallest-divisor-opt-2 n)
    (find-divisor-opt-2 n 3))
  
  (define (find-divisor-orig n test-divisor)
    (cond ((> (square test-divisor) n) n)
	  ((divides? test-divisor n) test-divisor)
	  (else (find-divisor n (+ test-divisor 1)))))

  (define (find-divisor-opt-1 n test-divisor)
    (cond ((> (square test-divisor) n) n)
	  ((divides? test-divisor n) test-divisor)
	  (else (find-divisor n (if (= test-divisor 2) 3 (+ test-divisor 2))))))

  (define (find-divisor-opt-2 n test-divisor)
    (cond ((> (square test-divisor) n) n)
	  ((divides? test-divisor n) test-divisor)
	  (else (find-divisor n (+ test-divisor 2)))))

  (define (divides? d n)
    (= (remainder n d) 0))

  (define (timed-prime-test n)
    (define (time start-time)
      (prime? n)
      (- (runtime) start-time))
    (time (runtime)))

  (define (timed-prime-test-avg n times)
    (define (iter sum count)
      (if (= count 0)
	  sum
	  (iter (+ sum (timed-prime-test n))
		(dec count))))
    (/ (iter 0 times) (* 1.0 times)))

  (define (display-time-measurement n duration)
    (display "|")
    (display n)
    (display "|")
    (display duration)
    (display "|")
    (newline))

  (define (search-for-primes n limit)
    (cond ((= limit 0) (display ""))
	  ((prime? n)
	   (display-time-measurement n (timed-prime-test-avg n 1000))
	   (search-for-primes (+ n 1) (dec limit)))
	  (else
	   (search-for-primes (+ n 1) limit))))
  (search-for-primes 100000 3)
  (search-for-primes 1000000 3)
  (search-for-primes 10000000 3)
  (search-for-primes 100000000 3)
  (search-for-primes 1000000000 3)
  (search-for-primes 10000000000 3)
  (search-for-primes 100000000000 3)

#+end_src


#+NAME: times-sequential-comparison
|--------------+------------+----------------+------------------+---------+-----------|
|        prime | t-seq (ms) | t-seq-opt (ms) | t-seq-opt-2 (ms) | rat-opt | rat-opt-2 |
|--------------+------------+----------------+------------------+---------+-----------|
|       100003 |      0.933 |          0.524 |            0.517 |    1.78 |       1.8 |
|       100019 |      0.918 |          0.538 |            0.513 |    1.71 |      1.79 |
|       100043 |       0.91 |          0.537 |             0.48 |    1.69 |       1.9 |
|      1000003 |      2.767 |          1.555 |            1.469 |    1.78 |      1.88 |
|      1000033 |      2.795 |          1.551 |            1.427 |     1.8 |      1.96 |
|      1000037 |      2.768 |          1.557 |            1.471 |    1.78 |      1.88 |
|     10000019 |      8.637 |          4.788 |            4.508 |     1.8 |      1.92 |
|     10000079 |      8.615 |          4.789 |            4.528 |     1.8 |       1.9 |
|     10000103 |      8.608 |          4.778 |            4.508 |     1.8 |      1.91 |
|    100000007 |      27.17 |         15.055 |           14.184 |     1.8 |      1.92 |
|    100000037 |     27.139 |         15.034 |            14.17 |    1.81 |      1.92 |
|    100000039 |     27.309 |         15.039 |           14.162 |    1.82 |      1.93 |
|   1000000007 |      86.77 |         47.541 |           44.719 |    1.83 |      1.94 |
|   1000000009 |     86.236 |         47.623 |           44.785 |    1.81 |      1.93 |
|   1000000021 |      86.75 |         48.233 |           45.291 |     1.8 |      1.92 |
|  10000000019 |    279.596 |        151.363 |          138.577 |    1.85 |      2.02 |
|  10000000033 |    271.998 |        151.311 |          136.069 |     1.8 |       2.0 |
|  10000000061 |    272.127 |        151.024 |          136.114 |     1.8 |       2.0 |
| 100000000003 |    859.095 |        475.512 |          430.351 |    1.81 |       2.0 |
| 100000000019 |    862.939 |        475.617 |          429.859 |    1.81 |      2.01 |
| 100000000057 |    859.008 |        475.643 |          430.389 |    1.81 |       2.0 |
|--------------+------------+----------------+------------------+---------+-----------|

So this is not exactly 2x increase, more like 1.8x, bet we added ~if~ and it probably eats into the time. As ~search-for-prime~ calls ~timed-prime-test~ only for primes, remove ~if~ and assume it starts divisor search from 3.

And indeed, with that ~if~ removed, ~rat-opt-2~ is much closer to $2$x than ~rat-opt~.

