s1/section-1.2.6-v2-testing-for-primality.html


<div id="outline-container-orgfff38ea" class="outline-3">
<h3 id="orgfff38ea"><span class="section-number-3">1.5.</span> Ex 1.23 - Optimize the \(O(\sqrt{n})\) version</h3>
<div class="outline-text-3" id="text-1-5">
<div class="org-src-container">
<pre class="src src-racket">#lang sicp

(define (square x) (* x x))

(define (prime? n)
  (= (smallest-divisor-opt-2 n) n))

(define (smallest-divisor-orig n)
  (find-divisor-opt-1 n 2))

(define (smallest-divisor-opt-2 n)
  (find-divisor-opt-2 n 3))

(define (find-divisor-orig n test-divisor)
  (cond ((&gt; (square test-divisor) n) n)
	((divides? test-divisor n) test-divisor)
	(else (find-divisor n (+ test-divisor 1)))))

(define (find-divisor-opt-1 n test-divisor)
  (cond ((&gt; (square test-divisor) n) n)
	((divides? test-divisor n) test-divisor)
	(else (find-divisor n (if (= test-divisor 2) 3 (+ test-divisor 2))))))

(define (find-divisor-opt-2 n test-divisor)
  (cond ((&gt; (square test-divisor) n) n)
	((divides? test-divisor n) test-divisor)
	(else (find-divisor n (+ test-divisor 2)))))

(define (divides? d n)
  (= (remainder n d) 0))

(define (timed-prime-test n)
  (define (time start-time)
    (prime? n)
    (- (runtime) start-time))
  (time (runtime)))

(define (timed-prime-test-avg n times)
  (define (iter sum count)
    (if (= count 0)
	sum
	(iter (+ sum (timed-prime-test n))
	      (dec count))))
  (/ (iter 0 times) (* 1.0 times)))

(define (display-time-measurement n duration)
  (display "|")
  (display n)
  (display "|")
  (display duration)
  (display "|")
  (newline))

(define (search-for-primes n limit)
  (cond ((= limit 0) (display ""))
	((prime? n)
	 (display-time-measurement n (timed-prime-test-avg n 1000))
	 (search-for-primes (+ n 1) (dec limit)))
	(else
	 (search-for-primes (+ n 1) limit))))
(search-for-primes 100000 3)
(search-for-primes 1000000 3)
(search-for-primes 10000000 3)
(search-for-primes 100000000 3)
(search-for-primes 1000000000 3)
(search-for-primes 10000000000 3)
(search-for-primes 100000000000 3)

</pre>
</div>


<table id="org136f76f" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">prime</th>
<th scope="col" class="org-right">t-seq (ms)</th>
<th scope="col" class="org-right">t-seq-opt (ms)</th>
<th scope="col" class="org-right">t-seq-opt-2 (ms)</th>
<th scope="col" class="org-right">rat-opt</th>
<th scope="col" class="org-right">rat-opt-2</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">100003</td>
<td class="org-right">0.933</td>
<td class="org-right">0.524</td>
<td class="org-right">0.517</td>
<td class="org-right">1.78</td>
<td class="org-right">1.8</td>
</tr>

<tr>
<td class="org-right">100019</td>
<td class="org-right">0.918</td>
<td class="org-right">0.538</td>
<td class="org-right">0.513</td>
<td class="org-right">1.71</td>
<td class="org-right">1.79</td>
</tr>

<tr>
<td class="org-right">100043</td>
<td class="org-right">0.91</td>
<td class="org-right">0.537</td>
<td class="org-right">0.48</td>
<td class="org-right">1.69</td>
<td class="org-right">1.9</td>
</tr>

<tr>
<td class="org-right">1000003</td>
<td class="org-right">2.767</td>
<td class="org-right">1.555</td>
<td class="org-right">1.469</td>
<td class="org-right">1.78</td>
<td class="org-right">1.88</td>
</tr>

<tr>
<td class="org-right">1000033</td>
<td class="org-right">2.795</td>
<td class="org-right">1.551</td>
<td class="org-right">1.427</td>
<td class="org-right">1.8</td>
<td class="org-right">1.96</td>
</tr>

<tr>
<td class="org-right">1000037</td>
<td class="org-right">2.768</td>
<td class="org-right">1.557</td>
<td class="org-right">1.471</td>
<td class="org-right">1.78</td>
<td class="org-right">1.88</td>
</tr>

<tr>
<td class="org-right">10000019</td>
<td class="org-right">8.637</td>
<td class="org-right">4.788</td>
<td class="org-right">4.508</td>
<td class="org-right">1.8</td>
<td class="org-right">1.92</td>
</tr>

<tr>
<td class="org-right">10000079</td>
<td class="org-right">8.615</td>
<td class="org-right">4.789</td>
<td class="org-right">4.528</td>
<td class="org-right">1.8</td>
<td class="org-right">1.9</td>
</tr>

<tr>
<td class="org-right">10000103</td>
<td class="org-right">8.608</td>
<td class="org-right">4.778</td>
<td class="org-right">4.508</td>
<td class="org-right">1.8</td>
<td class="org-right">1.91</td>
</tr>

<tr>
<td class="org-right">100000007</td>
<td class="org-right">27.17</td>
<td class="org-right">15.055</td>
<td class="org-right">14.184</td>
<td class="org-right">1.8</td>
<td class="org-right">1.92</td>
</tr>

<tr>
<td class="org-right">100000037</td>
<td class="org-right">27.139</td>
<td class="org-right">15.034</td>
<td class="org-right">14.17</td>
<td class="org-right">1.81</td>
<td class="org-right">1.92</td>
</tr>

<tr>
<td class="org-right">100000039</td>
<td class="org-right">27.309</td>
<td class="org-right">15.039</td>
<td class="org-right">14.162</td>
<td class="org-right">1.82</td>
<td class="org-right">1.93</td>
</tr>

<tr>
<td class="org-right">1000000007</td>
<td class="org-right">86.77</td>
<td class="org-right">47.541</td>
<td class="org-right">44.719</td>
<td class="org-right">1.83</td>
<td class="org-right">1.94</td>
</tr>

<tr>
<td class="org-right">1000000009</td>
<td class="org-right">86.236</td>
<td class="org-right">47.623</td>
<td class="org-right">44.785</td>
<td class="org-right">1.81</td>
<td class="org-right">1.93</td>
</tr>

<tr>
<td class="org-right">1000000021</td>
<td class="org-right">86.75</td>
<td class="org-right">48.233</td>
<td class="org-right">45.291</td>
<td class="org-right">1.8</td>
<td class="org-right">1.92</td>
</tr>

<tr>
<td class="org-right">10000000019</td>
<td class="org-right">279.596</td>
<td class="org-right">151.363</td>
<td class="org-right">138.577</td>
<td class="org-right">1.85</td>
<td class="org-right">2.02</td>
</tr>

<tr>
<td class="org-right">10000000033</td>
<td class="org-right">271.998</td>
<td class="org-right">151.311</td>
<td class="org-right">136.069</td>
<td class="org-right">1.8</td>
<td class="org-right">2.0</td>
</tr>

<tr>
<td class="org-right">10000000061</td>
<td class="org-right">272.127</td>
<td class="org-right">151.024</td>
<td class="org-right">136.114</td>
<td class="org-right">1.8</td>
<td class="org-right">2.0</td>
</tr>

<tr>
<td class="org-right">100000000003</td>
<td class="org-right">859.095</td>
<td class="org-right">475.512</td>
<td class="org-right">430.351</td>
<td class="org-right">1.81</td>
<td class="org-right">2.0</td>
</tr>

<tr>
<td class="org-right">100000000019</td>
<td class="org-right">862.939</td>
<td class="org-right">475.617</td>
<td class="org-right">429.859</td>
<td class="org-right">1.81</td>
<td class="org-right">2.01</td>
</tr>

<tr>
<td class="org-right">100000000057</td>
<td class="org-right">859.008</td>
<td class="org-right">475.643</td>
<td class="org-right">430.389</td>
<td class="org-right">1.81</td>
<td class="org-right">2.0</td>
</tr>
</tbody>
</table>

<p>
So this is not exactly 2x increase, more like 1.8x, bet we added <code>if</code> and it probably eats into the time. As <code>search-for-prime</code> calls <code>timed-prime-test</code> only for primes, remove <code>if</code> and assume it starts divisor search from 3.
</p>

<p>
And indeed, with that <code>if</code> removed, <code>rat-opt-2</code> is much closer to $2$x than <code>rat-opt</code>.
</p>
</div>
</div>
