s1/section-1.2.6-v2-testing-for-primality.org
** Ex 1.24 - Timing the $O(\log{n})$ version

For larger values of prime, ~(random n)~ fails, so I'll consider only those prime below $4.2*10^9$. Is this a real limitation of ~fast-prime?~? How do you select a large random number (e.g. is randomly selecting two digits separatly and combining them into 2-digit number the same as randomly selecting 2-digit number?)

#+begin_src racket :exports code :noweb yes
  <<fast-test>>

  (define (timed-prime-test n)
    (define (time start-time)
      (fast-prime? n 5)
      (- (runtime) start-time))
    (time (runtime)))

  (define (timed-prime-test-avg n times)
    (define (iter sum count)
      (if (= count 0)
	  sum
	  (iter (+ sum (timed-prime-test n))
		(dec count))))
    (/ (iter 0 times) (* 1.0 times)))

  (define (display-time-measurement n duration)
    (display "|")
    (display n)
    (display "|")
    (display duration)
    (display "|")
    (newline))

  (define (search-for-primes n limit)
    (cond ((= limit 0) (display ""))
	  ((fast-prime? n 5)
	   (display-time-measurement n (timed-prime-test-avg n 1000))
	   (search-for-primes (+ n 1) (dec limit)))
	  (else
	   (search-for-primes (+ n 1) limit))))
  (search-for-primes 100000 3)
  (search-for-primes 1000000 3)
  (search-for-primes 10000000 3)
  (search-for-primes 100000000 3)
  (search-for-primes 1000000000 3)

#+end_src

#+NAME: compare-seq-fast
|      prime | t-seq (ms) | t-seq-opt (ms) | t-seq-opt-2 (ms) | t-fast (ms) | rat-opt | rat-opt-2 | rat-fast |
|------------+------------+----------------+------------------+-------------+---------+-----------+----------|
|     100003 |      0.933 |          0.524 |            0.517 |        1.25 |    1.78 |       1.8 |     0.75 |
|     100019 |      0.918 |          0.538 |            0.513 |       1.288 |    1.71 |      1.79 |     0.71 |
|     100043 |       0.91 |          0.537 |             0.48 |       1.284 |    1.69 |       1.9 |     0.71 |
|    1000003 |      2.767 |          1.555 |            1.469 |       1.514 |    1.78 |      1.88 |     1.83 |
|    1000033 |      2.795 |          1.551 |            1.427 |       1.423 |     1.8 |      1.96 |     1.96 |
|    1000037 |      2.768 |          1.557 |            1.471 |        1.47 |    1.78 |      1.88 |     1.88 |
|   10000019 |      8.637 |          4.788 |            4.508 |       1.698 |     1.8 |      1.92 |     5.09 |
|   10000079 |      8.615 |          4.789 |            4.528 |       1.775 |     1.8 |       1.9 |     4.85 |
|   10000103 |      8.608 |          4.778 |            4.508 |        1.76 |     1.8 |      1.91 |     4.89 |
|  100000007 |      27.17 |         15.055 |           14.184 |       1.955 |     1.8 |      1.92 |     13.9 |
|  100000037 |     27.139 |         15.034 |            14.17 |       2.026 |    1.81 |      1.92 |     13.4 |
|  100000039 |     27.309 |         15.039 |           14.162 |       2.026 |    1.82 |      1.93 |    13.48 |
| 1000000007 |      86.77 |         47.541 |           44.719 |       2.172 |    1.83 |      1.94 |    39.95 |
| 1000000009 |     86.236 |         47.623 |           44.785 |       2.135 |    1.81 |      1.93 |    40.39 |
| 1000000021 |      86.75 |         48.233 |           45.291 |       2.189 |     1.8 |      1.92 |    39.63 |


With calculated constant - $c = \frac{\sqrt{n}}{\log_{2}{n}} \cdot \frac{1}{r}$, where $r = \frac{t_{seq}}{t_{fast}}$:

#+begin_src python :var t=compare-seq-fast :exports none
  import math

  return [
      r + [(math.sqrt(r[0]) / (math.log(r[0])/math.log(2))), (math.sqrt(r[0]) / (math.log(r[0])/math.log(2)))/r[7]]
      for r in t
  ]
#+end_src

#+RESULTS:
|      prime | t-seq (ms) | t-seq-opt (ms) | t-seq-opt-2 (ms) | t-fast (ms) | rat-opt | rat-opt-2 | rat-fast |     sqrt(n)/log(n) |              const |
|------------+------------+----------------+------------------+-------------+---------+-----------+----------+--------------------+--------------------|
|     100003 |      0.933 |          0.524 |            0.517 |        1.25 |    1.78 |       1.8 |     0.75 |  19.03904457599526 |  25.38539276799368 |
|     100019 |      0.918 |          0.538 |            0.513 |       1.288 |    1.71 |      1.79 |     0.71 | 19.040303011592457 | 26.817328185341488 |
|     100043 |       0.91 |          0.537 |             0.48 |       1.284 |    1.69 |       1.9 |     0.71 | 19.042190450385043 | 26.819986549838088 |
|    1000003 |      2.767 |          1.555 |            1.469 |       1.514 |    1.78 |      1.88 |     1.83 |  50.17173030680287 | 27.416246069291187 |
|    1000033 |      2.795 |          1.551 |            1.427 |       1.423 |     1.8 |      1.96 |     1.96 |  50.17237392891451 | 25.598149963731892 |
|    1000037 |      2.768 |          1.557 |            1.471 |        1.47 |    1.78 |      1.88 |     1.88 |  50.17245974437893 | 26.687478587435603 |
|   10000019 |      8.637 |          4.788 |            4.508 |       1.698 |     1.8 |      1.92 |     5.09 | 135.99160320815886 |  26.71740731005086 |
|   10000079 |      8.615 |          4.789 |            4.528 |       1.775 |     1.8 |       1.9 |     4.85 | 135.99196055849998 | 28.039579496597938 |
|   10000103 |      8.608 |          4.778 |            4.508 |        1.76 |     1.8 |      1.91 |     4.89 | 135.99210349830423 | 27.810246114172646 |
|  100000007 |      27.17 |         15.055 |           14.184 |       1.955 |     1.8 |      1.92 |     13.9 |  376.2875063201172 | 27.071043620152317 |
|  100000037 |     27.139 |         15.034 |            14.17 |       2.026 |    1.81 |      1.92 |     13.4 |   376.287556635001 | 28.081160942910522 |
|  100000039 |     27.309 |         15.039 |           14.162 |       2.026 |    1.82 |      1.93 |    13.48 |  376.2875599893263 | 27.914507417605808 |
| 1000000007 |      86.77 |         47.541 |           44.719 |       2.172 |    1.83 |      1.94 |    39.95 | 1057.7115925989249 | 26.475884670811634 |
| 1000000009 |     86.236 |         47.623 |           44.785 |       2.135 |    1.81 |      1.93 |    40.39 | 1057.7115935545569 | 26.187462083549317 |
| 1000000021 |      86.75 |         48.233 |           45.291 |       2.189 |     1.8 |      1.92 |    39.63 | 1057.7115992883487 |  26.68966942438427 |

** Ex 1.25 - Would naive expmod work?

Suggested expmod implementation:
#+begin_src racket
  #lang sicp

  ;; used
  (define (expmod base exp m)
    (cond ((= exp 0) 1)
	  ((even? exp) (remainder (square (expmod base (/ exp 2) m)) m))
	  (else (remainder (* base (expmod base (- exp 1) m)) m))))

  ;; suggested by Alyssa P. Hacker
  (define (expmod-alyssa base exp m)
    (remainder (fast-expt base exp) m))
#+end_src

One of the test steps is ~(expmod m p p)~, where ~p~ is a prime and ~m < p~ is some integer.
The option suggested by Alyssa would work for checking very small primes p, as then ~(fast-expt m p)~ would fit into usual number boundaries.
However, with anything a bit larger it would fail already with either boundary checks or arithmetic overflows.

