s1/section-1.2.6-v2-testing-for-primality.html

<div id="outline-container-org5b462ef" class="outline-3">
<h3 id="org5b462ef"><span class="section-number-3">1.6.</span> Ex 1.24 - Timing the \(O(\log{n})\) version</h3>
<div class="outline-text-3" id="text-1-6">
<p>
For larger values of prime, <code>(random n)</code> fails, so I'll consider only those prime below \(4.2*10^9\). Is this a real limitation of <code>fast-prime?</code>? How do you select a large random number (e.g. is randomly selecting two digits separatly and combining them into 2-digit number the same as randomly selecting 2-digit number?)
</p>

<div class="org-src-container">
<pre class="src src-racket">#lang sicp

(define (expmod base exp m)
  (define (square x) (* x x))
  (cond ((= exp 0) 1)
	((even? exp)
	 (remainder (square (expmod base (/ exp 2) m))
		    m))
	(else
	 (remainder (* base (expmod base (- exp 1) m))
		    m))))

(define (fermat-test n)
  (define (try-it d)
    (= (expmod d n n) d))
  (try-it (+ 1 (random (- n 1)))))

(define (fast-prime? n times)
  (cond ((= 0 times) #t)
	((fermat-test n) (fast-prime? n (dec times)))
	(else #f)))



(define (timed-prime-test n)
  (define (time start-time)
    (fast-prime? n 5)
    (- (runtime) start-time))
  (time (runtime)))

(define (timed-prime-test-avg n times)
  (define (iter sum count)
    (if (= count 0)
	sum
	(iter (+ sum (timed-prime-test n))
	      (dec count))))
  (/ (iter 0 times) (* 1.0 times)))

(define (display-time-measurement n duration)
  (display "|")
  (display n)
  (display "|")
  (display duration)
  (display "|")
  (newline))

(define (search-for-primes n limit)
  (cond ((= limit 0) (display ""))
	((fast-prime? n 5)
	 (display-time-measurement n (timed-prime-test-avg n 1000))
	 (search-for-primes (+ n 1) (dec limit)))
	(else
	 (search-for-primes (+ n 1) limit))))
(search-for-primes 100000 3)
(search-for-primes 1000000 3)
(search-for-primes 10000000 3)
(search-for-primes 100000000 3)
(search-for-primes 1000000000 3)

</pre>
</div>

<table id="org7a85af3" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">prime</th>
<th scope="col" class="org-right">t-seq (ms)</th>
<th scope="col" class="org-right">t-seq-opt (ms)</th>
<th scope="col" class="org-right">t-seq-opt-2 (ms)</th>
<th scope="col" class="org-right">t-fast (ms)</th>
<th scope="col" class="org-right">rat-opt</th>
<th scope="col" class="org-right">rat-opt-2</th>
<th scope="col" class="org-right">rat-fast</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">100003</td>
<td class="org-right">0.933</td>
<td class="org-right">0.524</td>
<td class="org-right">0.517</td>
<td class="org-right">1.25</td>
<td class="org-right">1.78</td>
<td class="org-right">1.8</td>
<td class="org-right">0.75</td>
</tr>

<tr>
<td class="org-right">100019</td>
<td class="org-right">0.918</td>
<td class="org-right">0.538</td>
<td class="org-right">0.513</td>
<td class="org-right">1.288</td>
<td class="org-right">1.71</td>
<td class="org-right">1.79</td>
<td class="org-right">0.71</td>
</tr>

<tr>
<td class="org-right">100043</td>
<td class="org-right">0.91</td>
<td class="org-right">0.537</td>
<td class="org-right">0.48</td>
<td class="org-right">1.284</td>
<td class="org-right">1.69</td>
<td class="org-right">1.9</td>
<td class="org-right">0.71</td>
</tr>

<tr>
<td class="org-right">1000003</td>
<td class="org-right">2.767</td>
<td class="org-right">1.555</td>
<td class="org-right">1.469</td>
<td class="org-right">1.514</td>
<td class="org-right">1.78</td>
<td class="org-right">1.88</td>
<td class="org-right">1.83</td>
</tr>

<tr>
<td class="org-right">1000033</td>
<td class="org-right">2.795</td>
<td class="org-right">1.551</td>
<td class="org-right">1.427</td>
<td class="org-right">1.423</td>
<td class="org-right">1.8</td>
<td class="org-right">1.96</td>
<td class="org-right">1.96</td>
</tr>

<tr>
<td class="org-right">1000037</td>
<td class="org-right">2.768</td>
<td class="org-right">1.557</td>
<td class="org-right">1.471</td>
<td class="org-right">1.47</td>
<td class="org-right">1.78</td>
<td class="org-right">1.88</td>
<td class="org-right">1.88</td>
</tr>

<tr>
<td class="org-right">10000019</td>
<td class="org-right">8.637</td>
<td class="org-right">4.788</td>
<td class="org-right">4.508</td>
<td class="org-right">1.698</td>
<td class="org-right">1.8</td>
<td class="org-right">1.92</td>
<td class="org-right">5.09</td>
</tr>

<tr>
<td class="org-right">10000079</td>
<td class="org-right">8.615</td>
<td class="org-right">4.789</td>
<td class="org-right">4.528</td>
<td class="org-right">1.775</td>
<td class="org-right">1.8</td>
<td class="org-right">1.9</td>
<td class="org-right">4.85</td>
</tr>

<tr>
<td class="org-right">10000103</td>
<td class="org-right">8.608</td>
<td class="org-right">4.778</td>
<td class="org-right">4.508</td>
<td class="org-right">1.76</td>
<td class="org-right">1.8</td>
<td class="org-right">1.91</td>
<td class="org-right">4.89</td>
</tr>

<tr>
<td class="org-right">100000007</td>
<td class="org-right">27.17</td>
<td class="org-right">15.055</td>
<td class="org-right">14.184</td>
<td class="org-right">1.955</td>
<td class="org-right">1.8</td>
<td class="org-right">1.92</td>
<td class="org-right">13.9</td>
</tr>

<tr>
<td class="org-right">100000037</td>
<td class="org-right">27.139</td>
<td class="org-right">15.034</td>
<td class="org-right">14.17</td>
<td class="org-right">2.026</td>
<td class="org-right">1.81</td>
<td class="org-right">1.92</td>
<td class="org-right">13.4</td>
</tr>

<tr>
<td class="org-right">100000039</td>
<td class="org-right">27.309</td>
<td class="org-right">15.039</td>
<td class="org-right">14.162</td>
<td class="org-right">2.026</td>
<td class="org-right">1.82</td>
<td class="org-right">1.93</td>
<td class="org-right">13.48</td>
</tr>

<tr>
<td class="org-right">1000000007</td>
<td class="org-right">86.77</td>
<td class="org-right">47.541</td>
<td class="org-right">44.719</td>
<td class="org-right">2.172</td>
<td class="org-right">1.83</td>
<td class="org-right">1.94</td>
<td class="org-right">39.95</td>
</tr>

<tr>
<td class="org-right">1000000009</td>
<td class="org-right">86.236</td>
<td class="org-right">47.623</td>
<td class="org-right">44.785</td>
<td class="org-right">2.135</td>
<td class="org-right">1.81</td>
<td class="org-right">1.93</td>
<td class="org-right">40.39</td>
</tr>

<tr>
<td class="org-right">1000000021</td>
<td class="org-right">86.75</td>
<td class="org-right">48.233</td>
<td class="org-right">45.291</td>
<td class="org-right">2.189</td>
<td class="org-right">1.8</td>
<td class="org-right">1.92</td>
<td class="org-right">39.63</td>
</tr>
</tbody>
</table>


<p>
With calculated constant - \(c = \frac{\sqrt{n}}{\log_{2}{n}} \cdot \frac{1}{r}\), where \(r = \frac{t_{seq}}{t_{fast}}\):
</p>
</div>
</div>

<div id="outline-container-org5837ee8" class="outline-3">
<h3 id="org5837ee8"><span class="section-number-3">1.7.</span> Ex 1.25 - Would naive expmod work?</h3>
<div class="outline-text-3" id="text-1-7">
<p>
Suggested expmod implementation:
</p>
<div class="org-src-container">
<pre class="src src-racket">#lang sicp

;; used
(define (expmod base exp m)
  (cond ((= exp 0) 1)
	((even? exp) (remainder (square (expmod base (/ exp 2) m)) m))
	(else (remainder (* base (expmod base (- exp 1) m)) m))))

;; suggested by Alyssa P. Hacker
(define (expmod-alyssa base exp m)
  (remainder (fast-expt base exp) m))
</pre>
</div>

<p>
One of the test steps is <code>(expmod m p p)</code>, where <code>p</code> is a prime and <code>m &lt; p</code> is some integer.
The option suggested by Alyssa would work for checking very small primes p, as then <code>(fast-expt m p)</code> would fit into usual number boundaries.
However, with anything a bit larger it would fail already with either boundary checks or arithmetic overflows.
</p>
</div>
</div>
