s1/section-1.2.6-v2-testing-for-primality.org
** Ex 1.26 - Why "normal-order"-esque `square turns $O(\log{n})$ into $O(n)$
Louis Reasoner's version of ~expmod~:
#+begin_src racket
  #lang sicp

  (define (expmod base exp m)
    (cond ((= exp 0) 1)
	  ((even? exp)
	   (remainder (* (expmod base (/ exp 2) m)
			 (expmod base (/ exp 2) m))
		      m))
	  (else
	   (remainder (* base (expmod base (- exp 1) m))
		      m))))
#+end_src

Example:
#+begin_src racket
  ;; instead of
   (expmod 2 8 3)
    (expmod 2 4 3)
     (expmod 2 2 3)
       (expmod 2 1 3)
	(expmod 2 0 3)

  ;; this tree would be calculated
   (expmod 2 8 3)
    (expmod 2 4 3)
     (expmod 2 2 3)
       (expmod 2 1 3)
	(expmod 2 0 3)
       (expmod 2 1 3)
	(expmod 2 0 3)
     (expmod 2 2 3)
       (expmod 2 1 3)
	(expmod 2 0 3)
       (expmod 2 1 3)
	(expmod 2 0 3)
    (expmod 2 4 3)
     (expmod 2 2 3)
       (expmod 2 1 3)
	(expmod 2 0 3)
       (expmod 2 1 3)
	(expmod 2 0 3)
     (expmod 2 2 3)
       (expmod 2 1 3)
	(expmod 2 0 3)
       (expmod 2 1 3)
	(expmod 2 0 3)

#+end_src

Let $f(n)$ denote the number of operations performed for input $n$. For conveniece take $n=2^k$ for some $k$. Now on each step ~expmod~ is calculated twice with halfed input ~n/2~, so $f(n)=2f(n/2)=4f(n/4)=...=2^kf(1)=2^k=n$ (assuming $f(1)$ is constant). So the number of steps to calculate ~expmod~ for ~n~-th power is $\theta(n)$

** Ex 1.27 - Ensure Carmichael numbers fool the Fermat test

Carmichael number is a non-prime number $n$ such that for each $a < n$, $a^n \equiv a \pmod{n}$.

Below is a procedure to test out some known Carmichael numbers:

#+begin_src racket :noweb yes
  <<fast-test>>

  (define (fermat-vs-carmichael n)
    (define (iter a)
      (cond ((= a n) #t)
	    ((not (eq? (expmod a n n) a)) #f)
	    (else (iter (inc a)))))
    (iter 2))

  ;; ensure it fails for obviously composite non-Carmichael number
  (fermat-vs-carmichael 562)

  (fermat-vs-carmichael 561)
  (fermat-vs-carmichael 1105)
  (fermat-vs-carmichael 1729)
  (fermat-vs-carmichael 2465)

#+end_src

#+RESULTS:
: #f
: #t
: #t
: #t
: #t

** Ex 1.28 - Implement the Miller-Rabin test
*** Alternate form of the Fermat's Little Theorem:

#+begin_quote
If $n$ is a prime number and $a$ is any positive integer less than $n$ (so that $(a,n)=1$), then $a^{n-1} \equiv 1 \pmod{n}$.
#+end_quote

*** Miller-Rabin test
Pick random $a \lt n$,  ~(expmod a (- n 1) n)~.

When performing the squaring step in ~expmod~, check if a "nontrivial square root of 1 modulo n" is discovered (that is a number not equal to $1$ or $n-1$, whose square is equal to $1\mod{n}$. It is possible to prove that if such a nontrivial square root of 1 exists, then $n$ is not prime.

It is also possible to prove that if n is an odd number that is not prime, then for at least half the numbers $a < n$, computing $a^{n-1}$ in that way will reveal a nontrivial square root of 1 module n).

#+begin_src racket :noweb yes
  #lang sicp

  (define (square x) (* x x))

  (define (expmod-mr base exp m)
    (define (mr-check s)
      (if (and (not (eq? s 1))
	       (not (eq? s (- m 1)))
	       (= 1 (remainder (square s) m)))
	  0 ;; signal that nontrivial square root of 1 modulo n is found
	  (remainder (square s) m)))

    (cond ((zero? exp) 1)
	  ((even? exp)
	   (mr-check (expmod-mr base (/ exp 2) m)))
	  (else
	   (remainder (* base (expmod-mr base (dec exp) m))
		      m))))

  (define (miller-rabin-test n)
    (define (try-it a)
      (= (expmod-mr a (- n 1) n) 1))
    (try-it (+ 1 (random (- n 1)))))

  (define (fast-robust-prime? n count)
    (cond ((zero? count) #t)
	  ((miller-rabin-test n) (fast-robust-prime? n (dec count)))
	  (else #f)))

  (fast-robust-prime? 1729 5)
#+end_src

#+RESULTS:
: #f
