s1/section-1.2.6-v2-testing-for-primality.html

<div id="outline-container-org1f8de14" class="outline-3">
<h3 id="org1f8de14"><span class="section-number-3">1.8.</span> Ex 1.26 - Why "normal-order"-esque `square turns \(O(\log{n})\) into \(O(n)\)</h3>
<div class="outline-text-3" id="text-1-8">
<p>
Louis Reasoner's version of <code>expmod</code>:
</p>
<div class="org-src-container">
<pre class="src src-racket">#lang sicp

(define (expmod base exp m)
  (cond ((= exp 0) 1)
	((even? exp)
	 (remainder (* (expmod base (/ exp 2) m)
		       (expmod base (/ exp 2) m))
		    m))
	(else
	 (remainder (* base (expmod base (- exp 1) m))
		    m))))
</pre>
</div>

<p>
Example:
</p>
<div class="org-src-container">
<pre class="src src-racket">;; instead of
 (expmod 2 8 3)
  (expmod 2 4 3)
   (expmod 2 2 3)
     (expmod 2 1 3)
      (expmod 2 0 3)

;; this tree would be calculated
 (expmod 2 8 3)
  (expmod 2 4 3)
   (expmod 2 2 3)
     (expmod 2 1 3)
      (expmod 2 0 3)
     (expmod 2 1 3)
      (expmod 2 0 3)
   (expmod 2 2 3)
     (expmod 2 1 3)
      (expmod 2 0 3)
     (expmod 2 1 3)
      (expmod 2 0 3)
  (expmod 2 4 3)
   (expmod 2 2 3)
     (expmod 2 1 3)
      (expmod 2 0 3)
     (expmod 2 1 3)
      (expmod 2 0 3)
   (expmod 2 2 3)
     (expmod 2 1 3)
      (expmod 2 0 3)
     (expmod 2 1 3)
      (expmod 2 0 3)

</pre>
</div>

<p>
Let \(f(n)\) denote the number of operations performed for input \(n\). For conveniece take \(n=2^k\) for some \(k\). Now on each step <code>expmod</code> is calculated twice with halfed input <code>n/2</code>, so \(f(n)=2f(n/2)=4f(n/4)=...=2^kf(1)=2^k=n\) (assuming \(f(1)\) is constant). So the number of steps to calculate <code>expmod</code> for <code>n</code>-th power is \(\theta(n)\)
</p>
</div>
</div>

<div id="outline-container-orgc11382e" class="outline-3">
<h3 id="orgc11382e"><span class="section-number-3">1.9.</span> Ex 1.27 - Ensure Carmichael numbers fool the Fermat test</h3>
<div class="outline-text-3" id="text-1-9">
<p>
Carmichael number is a non-prime number \(n\) such that for each \(a < n\), \(a^n \equiv a \pmod{n}\).
</p>

<p>
Below is a procedure to test out some known Carmichael numbers:
</p>

<div class="org-src-container">
<pre class="src src-racket">#lang sicp

(define (expmod base exp m)
  (define (square x) (* x x))
  (cond ((= exp 0) 1)
	((even? exp)
	 (remainder (square (expmod base (/ exp 2) m))
		    m))
	(else
	 (remainder (* base (expmod base (- exp 1) m))
		    m))))

(define (fermat-test n)
  (define (try-it d)
    (= (expmod d n n) d))
  (try-it (+ 1 (random (- n 1)))))

(define (fast-prime? n times)
  (cond ((= 0 times) #t)
	((fermat-test n) (fast-prime? n (dec times)))
	(else #f)))



(define (fermat-vs-carmichael n)
  (define (iter a)
    (cond ((= a n) #t)
	  ((not (eq? (expmod a n n) a)) #f)
	  (else (iter (inc a)))))
  (iter 2))

;; ensure it fails for obviously composite non-Carmichael number
(fermat-vs-carmichael 562)

(fermat-vs-carmichael 561)
(fermat-vs-carmichael 1105)
(fermat-vs-carmichael 1729)
(fermat-vs-carmichael 2465)

</pre>
</div>
</div>
</div>

<div id="outline-container-org3b52b9d" class="outline-3">
<h3 id="org3b52b9d"><span class="section-number-3">1.10.</span> Ex 1.28 - Implement the Miller-Rabin test</h3>
<div class="outline-text-3" id="text-1-10">
</div>
<div id="outline-container-orgf4a2a66" class="outline-4">
<h4 id="orgf4a2a66"><span class="section-number-4">1.10.1.</span> Alternate form of the Fermat's Little Theorem:</h4>
<div class="outline-text-4" id="text-1-10-1">
<blockquote>
<p>
If \(n\) is a prime number and \(a\) is any positive integer less than \(n\) (so that \((a,n)=1\)), then \(a^{n-1} \equiv 1 \pmod{n}\).
</p>
</blockquote>
</div>
</div>

<div id="outline-container-orgd4e8623" class="outline-4">
<h4 id="orgd4e8623"><span class="section-number-4">1.10.2.</span> Miller-Rabin test</h4>
<div class="outline-text-4" id="text-1-10-2">
<p>
Pick random \(a \lt n\),  <code>(expmod a (- n 1) n)</code>.
</p>

<p>
When performing the squaring step in <code>expmod</code>, check if a "nontrivial square root of 1 modulo n" is discovered (that is a number not equal to \(1\) or \(n-1\), whose square is equal to \(1\mod{n}\). It is possible to prove that if such a nontrivial square root of 1 exists, then \(n\) is not prime.
</p>

<p>
It is also possible to prove that if n is an odd number that is not prime, then for at least half the numbers \(a < n\), computing \(a^{n-1}\) in that way will reveal a nontrivial square root of 1 module n).
</p>

<div class="org-src-container">
<pre class="src src-racket">#lang sicp

(define (square x) (* x x))

(define (expmod-mr base exp m)
  (define (mr-check s)
    (if (and (not (eq? s 1))
	     (not (eq? s (- m 1)))
	     (= 1 (remainder (square s) m)))
	0 ;; signal that nontrivial square root of 1 modulo n is found
	(remainder (square s) m)))

  (cond ((zero? exp) 1)
	((even? exp)
	 (mr-check (expmod-mr base (/ exp 2) m)))
	(else
	 (remainder (* base (expmod-mr base (dec exp) m))
		    m))))

(define (miller-rabin-test n)
  (define (try-it a)
    (= (expmod-mr a (- n 1) n) 1))
  (try-it (+ 1 (random (- n 1)))))

(define (fast-robust-prime? n count)
  (cond ((zero? count) #t)
	((miller-rabin-test n) (fast-robust-prime? n (dec count)))
	(else #f)))

(fast-robust-prime? 1729 5)
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: LMG</p>
<p class="date">Created: 2023-05-21 Sun 18:54</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
